Ran Plan for dir: `terraform/dev/vpc` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.aws_eks_cluster.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "this" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + compute_config            = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "dev-cw"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + remote_network_config     = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + storage_config            = (known after apply)
      + tags                      = (known after apply)
      + upgrade_policy            = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
      + zonal_shift_config        = (known after apply)
    }

  # module.eks.data.aws_eks_cluster_auth.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster_auth" "this" {
      + id    = (known after apply)
      + name  = "dev-cw"
      + token = (sensitive value)
    }

  # module.eks.aws_eks_addon.pod_identity will be created
+ resource "aws_eks_addon" "pod_identity" {
      + addon_name           = "eks-pod-identity-agent"
      + addon_version        = "v1.3.0-eksbuild.1"
      + arn                  = (known after apply)
      + cluster_name         = "dev-cw"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.eks.aws_eks_cluster.this will be created
+ resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "dev-cw"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags_all                      = (known after apply)
      + version                       = "1.30"

      + access_config {
          + authentication_mode                         = "API"
          + bootstrap_cluster_creator_admin_permissions = true
        }

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = [
              + "subnet-036e6e1b722ba4858",
              + "subnet-0991742238d04f925",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.general["general"] will be created
+ resource "aws_eks_node_group" "general" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "dev-cw"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + labels                 = {
          + "role" = "general"
        }
      + node_group_name        = "general"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-036e6e1b722ba4858",
          + "subnet-0991742238d04f925",
        ]
      + tags_all               = (known after apply)
      + version                = "1.30"

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 2
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.eks.aws_eks_pod_identity_association.argocd_image_updater will be created
+ resource "aws_eks_pod_identity_association" "argocd_image_updater" {
      + association_arn = (known after apply)
      + association_id  = (known after apply)
      + cluster_name    = "dev-cw"
      + id              = (known after apply)
      + namespace       = "argocd"
      + role_arn        = (known after apply)
      + service_account = "argocd-image-updater"
      + tags_all        = {}
    }

  # module.eks.aws_iam_role.argocd_image_updater will be created
+ resource "aws_iam_role" "argocd_image_updater" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "pods.eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-cw-argocd-image-updater"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.aws_iam_role.eks will be created
+ resource "aws_iam_role" "eks" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-cw-eks-cluster"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.aws_iam_role.nodes will be created
+ resource "aws_iam_role" "nodes" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-cw-eks-nodes"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.argocd_image_updater will be created
+ resource "aws_iam_role_policy_attachment" "argocd_image_updater" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "dev-cw-argocd-image-updater"
    }

  # module.eks.aws_iam_role_policy_attachment.eks will be created
+ resource "aws_iam_role_policy_attachment" "eks" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "dev-cw-eks-cluster"
    }

  # module.eks.aws_iam_role_policy_attachment.nodes["1"] will be created
+ resource "aws_iam_role_policy_attachment" "nodes" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "dev-cw-eks-nodes"
    }

  # module.eks.aws_iam_role_policy_attachment.nodes["2"] will be created
+ resource "aws_iam_role_policy_attachment" "nodes" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "dev-cw-eks-nodes"
    }

  # module.eks.aws_iam_role_policy_attachment.nodes["3"] will be created
+ resource "aws_iam_role_policy_attachment" "nodes" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "dev-cw-eks-nodes"
    }

Plan: 12 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terraform/dev/vpc
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://6a94-95-70-165-105.ngrok-free.app/lock?id=devopscope%252Feks-tf-cw%252Fterraform%252Fdev%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terraform/dev/vpc
  ```
Plan: 12 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```